Public Member Functions | List of all members
ACAPI::v1::UniqueID Class Reference
API Infrastructure
A unique identifier for API objects. It contains the GUID of the element and the Token of the AddOn which instantiated the element. More...
#include <UniqueID.hpp>
 Public Member Functions
UniqueID (const GS::Guid &, const API_Token &)
const GS::Guid &  | GetGuid () const
Returns the unique identifier of the element.
const API_Token &  | GetToken () const
Returns the unique identifier of the AddOn which created this instance.
bool  | operator== (const UniqueID &) const
bool  | operator!= (const UniqueID &) const
bool  | operator< (const UniqueID &) const
Detailed Description
A unique identifier for API objects. It contains the GUID of the element and the Token of the AddOn which instantiated the element.
Constructor & Destructor Documentation
◆ UniqueID()
 ACAPI::v1::UniqueID::UniqueID  |  ( |  const GS::Guid &  |  ,
|  const API_Token &
)
Member Function Documentation
◆ GetGuid()
 const GS::Guid & ACAPI::v1::UniqueID::GetGuid  |  ( |   | ) |   const
Returns the unique identifier of the element.
Returns
The unique identifier of the element.
◆ GetToken()
 const API_Token & ACAPI::v1::UniqueID::GetToken  |  ( |   | ) |   const
Returns the unique identifier of the AddOn which created this instance.
Returns
The unique identifier of the AddOn which created this instance.
◆ operator!=()
 bool ACAPI::v1::UniqueID::operator!=  |  ( |  const UniqueID &  |   | ) |   const
◆ operator<()
 bool ACAPI::v1::UniqueID::operator<  |  ( |  const UniqueID &  |   | ) |   const
◆ operator==()
 bool ACAPI::v1::UniqueID::operator==  |  ( |  const UniqueID &  |   | ) |   const